Hello @travis-jorge, can you please tell me if I am doing anything different than you? I was unable to reproduce this.
I am running:
* Ubuntu 20.04
* Localstack `latest` docker image (running it via `docker run -ti --rm --name localstack -e DEBUG=1 -e SERVICES=kms -p 4566:4566 localstack/localstack:latest`)
* Terraform v1.0.2

main.tf:
```
provider "aws" {
  region                      = "us-east-1"
  
  access_key                  = "test"
  secret_key                  = "test"
  skip_credentials_validation = true
  skip_metadata_api_check     = true
  skip_requesting_account_id  = true

  endpoints {
    kms            = "http://localhost:4566"
  }
}

resource "aws_kms_key" "test_svc_kms_key" {
  deletion_window_in_days  = var.deletion_window_in_days
  enable_key_rotation      = var.enable_key_rotation
  description              = var.description
  key_usage                = var.key_usage
  customer_master_key_spec = var.customer_master_key_spec
}

variable "enable_key_rotation" {
  type        = bool
  default     = true
  description = "Specifies whether key rotation is enabled"
}

variable "description" {
  type        = string
  default     = "Parameter Store KMS master key"
  description = "The description of the key as viewed in AWS console"
}

variable "key_usage" {
  type        = string
  default     = "ENCRYPT_DECRYPT"
  description = "Specifies the intended use of the key. Valid values: `ENCRYPT_DECRYPT` or `SIGN_VERIFY`."
}

variable "customer_master_key_spec" {
  type        = string
  default     = "SYMMETRIC_DEFAULT"
  description = "Specifies whether the key contains a symmetric key or an asymmetric key pair and the encryption algorithms or signing algorithms that the key supports. Valid values: `SYMMETRIC_DEFAULT`, `RSA_2048`, `RSA_3072`, `RSA_4096`, `ECC_NIST_P256`, `ECC_NIST_P384`, `ECC_NIST_P521`, or `ECC_SECG_P256K1`."
}

variable "deletion_window_in_days" {
  default = 10
}
```

apply:
```
  # aws_kms_key.test_svc_kms_key will be created
  + resource "aws_kms_key" "test_svc_kms_key" {
      + arn                      = (known after apply)
      + customer_master_key_spec = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days  = 10
      + description              = "Parameter Store KMS master key"
      + enable_key_rotation      = true
      + id                       = (known after apply)
      + is_enabled               = true
      + key_id                   = (known after apply)
      + key_usage                = "ENCRYPT_DECRYPT"
      + policy                   = (known after apply)
      + tags_all                 = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_kms_key.test_svc_kms_key: Creating...
aws_kms_key.test_svc_kms_key: Creation complete after 4s [id=51fe1747-6c30-4fc3-8c6b-48c865564192]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
(base) 
```

destroy:
```
Terraform will perform the following actions:

  # aws_kms_key.test_svc_kms_key will be destroyed
  - resource "aws_kms_key" "test_svc_kms_key" {
      - arn                      = "arn:aws:kms:us-east-1:000000000000:key/51fe1747-6c30-4fc3-8c6b-48c865564192" -> null
      - customer_master_key_spec = "SYMMETRIC_DEFAULT" -> null
      - deletion_window_in_days  = 10 -> null
      - description              = "Parameter Store KMS master key" -> null
      - enable_key_rotation      = true -> null
      - id                       = "51fe1747-6c30-4fc3-8c6b-48c865564192" -> null
      - is_enabled               = true -> null
      - key_id                   = "51fe1747-6c30-4fc3-8c6b-48c865564192" -> null
      - key_usage                = "ENCRYPT_DECRYPT" -> null
      - policy                   = jsonencode(
            {
              - Id        = "key-default-policy"
              - Statement = [
                  - {
                      - Action    = "kms:*"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::000000000000:root"
                        }
                      - Resource  = "*"
                      - Sid       = "Enable IAM User Permissions"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - tags                     = {} -> null
      - tags_all                 = {} -> null
    }

Plan: 0 to add, 0 to change, 1 to destroy.

Do you really want to destroy all resources?
  Terraform will destroy all your managed infrastructure, as shown above.
  There is no undo. Only 'yes' will be accepted to confirm.

  Enter a value: yes

aws_kms_key.test_svc_kms_key: Destroying... [id=51fe1747-6c30-4fc3-8c6b-48c865564192]
aws_kms_key.test_svc_kms_key: Destruction complete after 0s

Destroy complete! Resources: 1 destroyed.
```

If not, please give it a try to the terraform code I pasted before, it looks to me you are probably not hardcoding the endpoint and/or the keys for the provider. In any case let me know. Cheers!